_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_1 (Dense)              (None, 12)                204       
_________________________________________________________________
dense_2 (Dense)              (None, 8)                 104       
_________________________________________________________________
dense_3 (Dense)              (None, 1)                 9         
=================================================================
Total params: 317
Trainable params: 317
Non-trainable params: 0
_________________________________________________________________
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm_1 (LSTM)                (None, 1, 50)             13400     
_________________________________________________________________
dropout_1 (Dropout)          (None, 1, 50)             0         
_________________________________________________________________
lstm_2 (LSTM)                (None, 100)               60400     
_________________________________________________________________
dropout_2 (Dropout)          (None, 100)               0         
_________________________________________________________________
dense_4 (Dense)              (None, 1)                 101       
_________________________________________________________________
activation_1 (Activation)    (None, 1)                 0         
=================================================================
Total params: 73,901
Trainable params: 73,901
Non-trainable params: 0
_________________________________________________________________
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm_3 (LSTM)                (None, 1, 50)             13400     
_________________________________________________________________
dropout_3 (Dropout)          (None, 1, 50)             0         
_________________________________________________________________
lstm_4 (LSTM)                (None, 100)               60400     
_________________________________________________________________
dropout_4 (Dropout)          (None, 100)               0         
_________________________________________________________________
dense_5 (Dense)              (None, 1)                 101       
_________________________________________________________________
activation_2 (Activation)    (None, 1)                 0         
=================================================================
Total params: 73,901
Trainable params: 73,901
Non-trainable params: 0
_________________________________________________________________
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm_5 (LSTM)                (None, 1, 50)             13400     
_________________________________________________________________
dropout_5 (Dropout)          (None, 1, 50)             0         
_________________________________________________________________
lstm_6 (LSTM)                (None, 1, 100)            60400     
_________________________________________________________________
dropout_6 (Dropout)          (None, 1, 100)            0         
_________________________________________________________________
lstm_7 (LSTM)                (None, 100)               80400     
_________________________________________________________________
dense_6 (Dense)              (None, 1)                 101       
_________________________________________________________________
activation_3 (Activation)    (None, 1)                 0         
=================================================================
Total params: 154,301
Trainable params: 154,301
Non-trainable params: 0
_________________________________________________________________
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm_8 (LSTM)                (None, 1, 150)            100200    
_________________________________________________________________
dropout_7 (Dropout)          (None, 1, 150)            0         
_________________________________________________________________
lstm_9 (LSTM)                (None, 1, 250)            401000    
_________________________________________________________________
dropout_8 (Dropout)          (None, 1, 250)            0         
_________________________________________________________________
lstm_10 (LSTM)               (None, 200)               360800    
_________________________________________________________________
dense_7 (Dense)              (None, 1)                 201       
_________________________________________________________________
activation_4 (Activation)    (None, 1)                 0         
=================================================================
Total params: 862,201
Trainable params: 862,201
Non-trainable params: 0
_________________________________________________________________
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm_11 (LSTM)               (None, 1, 150)            100200    
_________________________________________________________________
dropout_9 (Dropout)          (None, 1, 150)            0         
_________________________________________________________________
lstm_12 (LSTM)               (None, 1, 300)            541200    
_________________________________________________________________
dropout_10 (Dropout)         (None, 1, 300)            0         
_________________________________________________________________
lstm_13 (LSTM)               (None, 200)               400800    
_________________________________________________________________
dense_8 (Dense)              (None, 1)                 201       
_________________________________________________________________
activation_5 (Activation)    (None, 1)                 0         
=================================================================
Total params: 1,042,401
Trainable params: 1,042,401
Non-trainable params: 0
_________________________________________________________________
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm_14 (LSTM)               (None, 1, 150)            100200    
_________________________________________________________________
dropout_11 (Dropout)         (None, 1, 150)            0         
_________________________________________________________________
lstm_15 (LSTM)               (None, 1, 300)            541200    
_________________________________________________________________
dropout_12 (Dropout)         (None, 1, 300)            0         
_________________________________________________________________
lstm_16 (LSTM)               (None, 1, 200)            400800    
_________________________________________________________________
dropout_13 (Dropout)         (None, 1, 200)            0         
_________________________________________________________________
lstm_17 (LSTM)               (None, 450)               1171800   
_________________________________________________________________
dense_9 (Dense)              (None, 1)                 451       
_________________________________________________________________
activation_6 (Activation)    (None, 1)                 0         
=================================================================
Total params: 2,214,451
Trainable params: 2,214,451
Non-trainable params: 0
_________________________________________________________________
